Repository: elenabougaran/MyBikeMate
Catalog: CarCare/*.lproj/Localizable.strings
Languages: es, fr

# dashboard_key
source: Dasboard
es: Inicio
fr: Accueil

# maintenance_key
source: Maintenance
es: Mantenimientos
fr: Entretiens

# Settings_key
source: Settings
es: Ajustes
fr: Paramètres

# question_welcome
source: Welcome to MyBikeMate!
es: ¡Bienvenido a MyBikeMate!
fr: Bienvenue dans MyBikeMate !

# question_daily_use
source: You use your bike daily and are tired of forgetting when to schedule the next maintenance ?
es: ¿Usas tu bicicleta a diario y estás cansado de olvidar cuándo programar el próximo mantenimiento?
fr: Tu utilises ton vélo au quotidien et tu es lassé de ne plus te rappeler quand programmer ton prochain entretien ?

# question_sell_bike
source: You want to prove that your bike is up to date with its maintenance ?
es: ¿Quieres demostrar que tu bicicleta está al día con su mantenimiento?
fr: Tu veux prouver que ton vélo est à jour dans son entretien ?

# question_share_history
source: Do you want to share your bike’s maintenance history with your mechanic or the future buyer of your bike?
es: ¿Quieres compartir el historial de mantenimiento de tu bicicleta con tu mecánico o con el futuro comprador?
fr: Tu veux partager l’historique d’entretien avec ton réparateur ou le futur acquéreur de ton vélo ?

# button_next
source: Next
es: Siguiente
fr: Suivant

# button_start
source: I take care of my bike
es: ¡Cuido mi bici!
fr: Je prends soin de mon vélo !

# stay_informed_key
source: Stay informed
es: Mantente informado
fr: Restez informé

# enable_notifications_text_key
source: Enable notifications to be informed of maintenance reminders and never miss anything!
es: ¡Active las notificaciones para recibir recordatorios de mantenimiento y no perderse nada!
fr: Activez les notifications pour être informé des rappels des entretiens à réaliser et ne rien manquer !

# enable_notifications_button_key
source: Enable notifications
es: Activar notificaciones
fr: Activer les notifications

# error_title_key
source: Error
fr: Erreur

# success_title_key
source: Success
es: Éxito
fr: Succès

# notifications_enabled_message_key
source: Notifications successfully enabled!
es: ¡Notificaciones activadas con éxito!
fr: Notifications activées avec succès !

# notification_title
source: Upcoming Maintenance
es: Mantenimiento próximo
fr: Entretien à venir

# notification_body
source: Your %@ maintenance is scheduled for %@
es: Su mantenimiento de %@ está programado para %@
fr: Votre entretien %@ est prévu le %@

# notification_permission_denied
source: Notifications are disabled. Enable them in Settings > MyCarCheckup.
es: Notificaciones desactivadas. Actívalas en Ajustes > MyCarCheckup.
fr: Notifications désactivées. Activez-les dans Réglages > MyCarCheckup.

# notification_authorization_failed
source: Notification authorization failed. Please try again later.
es: Error de autorización de notificaciones. Inténtalo de nuevo más tarde.
fr: Erreur d'autorisation des notifications. Réessayez plus tard.

# notification_scheduling_failed
source: Unable to schedule the reminder: %@
es: No se puede programar el recordatorio: %@
fr: Impossible de programmer le rappel : %@

# notification_error
source: An error occurred while sending the notification.
es: Error de notificación: %@
fr: Erreur de notification : %@

# notifications_disabled_title
source: Notifications Disabled
es: Notificaciones Desactivadas
fr: Notifications désactivées

# notifications_disabled_message
source: Enable notifications in Settings > MyCarCheckup to receive reminders.
es: Activa las notificaciones en Ajustes > MyCarCheckup para recibir recordatorios.
fr: Activez les notifications dans Réglages > MyCarCheckup pour recevoir les rappels.

# cancel_button
source: Cancel
es: Cancelar
fr: Annuler

# open_settings_button
source: Open Settings
es: Abrir Ajustes
fr: Ouvrir Réglages

# welcome_key
source: Welcome to the app!
es: ¡Bienvenido a la aplicación!
fr: Bienvenue dans l'application!

# bike_info_key
source: Enter your bike information
es: Introduce la información de tu bicicleta
fr: Entre les informations de ton vélo

# brand_key
source: Brand
es: Marca
fr: Marque

# model_key
source: Model
es: Modelo
fr: Modèle

# year_of_manufacture_key
source: Year of manufacture
es: Año de fabricación
fr: Année de fabrication

# identification_number_message_key
source: Identification number (optionnal)
es: Número de identificación (opcional)
fr: Numéro d'identification (optionnel)

# button_add_bike_key
source: Add bike
es: Agregar bicicleta
fr: Ajouter le vélo

# navigation_title_modify_bike_key
source: My bike
es: Mi bicicleta
fr: Mon vélo

# bike_year_label
source: Manufacture :
es: Fabricación:
fr: Fabrication :

# last_maintenance_key
source: Last maintenance
es: Último mantenimiento
fr: Dernier entretien

# button_modify_bike_information
source: Modify bike information
es: Modificar la información de la bicicleta
fr: Modifier les infos du vélo

# button_Add_Maintenance
source: Add maintenance
es: Agregar mantenimiento
fr: Ajouter un entretien

# no_date_key
source: No date
es: Sin fecha
fr: Pas de date

source: Premium Feature
es: Funcionalidad Premium
fr: Fonctionnalité Premium

# share_summary_description
source: Share the full maintenance summary with your mechanic or when selling your bike.
es: Comparte el resumen completo del mantenimiento con tu mecánico o al vender tu bicicleta.
fr: Partagez le résumé complet de vos entretiens avec votre réparateur ou lors de la vente de votre vélo.

source: Unlock Now
es: Desbloquear ahora
fr: Débloquer maintenant

# take_photo
source: Take a photo
es: Tomar una foto
fr: Prendre une photo

# choose_library
source: Choose from library
es: Elegir de la biblioteca
fr: Choisir dans la bibliothèque

# bike_label
source: Bike
es: Bicicleta
fr: Vélo

# year_label
source: Year
es: Año
fr: Année

# identification_number_label
source: Identification Number
es: Número de identificación
fr: Numéro d'identification

# maintenance_type_label
source: Maintenance Type
es: Tipo de mantenimiento
fr: Type de maintenance

# return_key
source: Return
es: Volver
fr: Retour

# button_delete_bike
source: Delete bike
es: Eliminar mi bicicleta
fr: Supprimer mon vélo

# button_Modify_information_key
source: Modify information
es: Modificar la información
fr: Modifier les informations

# delete_bike_confirmation_title
source: Are you sure you want to delete the bike?
es: ¿Está seguro de que desea eliminar la bicicleta?
fr: Êtes-vous sûr de vouloir supprimer le vélo ?

# delete_bike_confirm
source: Delete
es: Eliminar
fr: Supprimer

# delete_bike_cancel
source: Cancel
es: Cancelar
fr: Annuler

# navigation_title_add_maintenance_key
source: Add maintenance
es: Agregar mantenimiento
fr: Ajouter un entretien

# maintenance_Type_key
source: Maintenance type
es: Tipo de mantenimiento
fr: Type d'entretien

# maintenance_date_key
source: Maintenance date
es: Fecha del mantenimiento
fr: Date de l'entretien

# done_key
source: Done
es: Terminado
fr: Terminé

# alert_error_title
source: Error
fr: Erreur

# alert_unknown_error
source: Unknown error
es: Error desconocido
fr: Erreur inconnue

# maintenances_to_come
source: Upcoming maintenance
es: Mantenimientos próximos
fr: Maintenances à venir

source: Completed maintenances
es: Mantenimientos completados
fr: Maintenances terminées

# record_maintenance_instructions_key
source: To view upcoming maintenance and your history, start by recording a completed maintenance for each category. You can do this from the home screen.
es: Para ver los próximos mantenimientos y tu historial, empieza registrando un mantenimiento completado en cada categoría. Puedes hacerlo desde la pantalla de inicio.
fr: Pour voir les prochains entretiens et votre historique, commencez par enregistrer un entretien terminé dans chaque catégorie. Vous pouvez le faire depuis l’écran d’accueil.

# days_remaining_key
source: %d day(s) remaining
es: %d día(s) restante(s)
fr: %d jour(s) restant(s)

# unknown_days_remaining_key
source: Number of days remaining unknown
es: Número de días restantes desconocido
fr: Nombre de jours restants inconnu

# frequency_key
source: Frequency:
es: Frecuencia:
fr: Fréquence:

# every_days_key
source: every %d day(s)
es: cada %d día(s)
fr: tous les %d jour(s)

# every_months_key
source: every %d month(s)
es: cada %d mes(es)
fr: tous les %d mois

# every_year_key
source: every %d year(s)
es: cada %d año(s)
fr: tous les %d ans

# button_update_key
source: Update
es: Actualizar
fr: Mettre à jour

# maintenance_history_key
source: Maintenance history
es: Historial de mantenimiento
fr: Historique d'entretien

# advice_and_information_key
source: Advice and information
es: Consejos e información
fr: Conseils & infos

# maintenance_up_to_date
source: Up to date
es: Al día
fr: À jour

# maintenance_not_yet
source: Not yet
es: Aún no
fr: Pas encore

# maintenance_due
source: To be planned
es: Vencido
fr: À faire

# navigation_title_settings_key
source: Settings
es: Ajustes
fr: Paramètres

# appearence_key
source: Appearence
es: Apariencia
fr: Apparence

# dark_mode_key
source: Dark mode
es: Modo oscuro
fr: Mode sombre

# handle_notifications_key
source: Handle notifications
es: Gestionar notificaciones
fr: Gérer les notifications

# information_key
source: Information
es: Información
fr: Informations

# legal_notice_key
source: Legal notice
es: Aviso legal
fr: Mentions légales

# legal_mentions_title
source: Legal Notice
es: Aviso legal
fr: Mentions légales

source: Unknown
es: Desconocido
fr: Inconnu

source: Check tire pressure
es: Revisar la presión de los neumáticos
fr: Vérifier la pression des pneus

source: Replace tires
es: Cambiar neumáticos
fr: Changer les pneus

# clean_and_lubricate_chain
source: Clean and lubricate the chain
es: Limpiar y lubricar la cadena
fr: Nettoyer et lubrifier la chaîne

source: Tighten main screws and bolts
es: Apretar tornillos y pernos principales
fr: Resserrer les vis et boulons principaux

source: Clean drivetrain
es: Limpiar la transmisión
fr: Nettoyer la transmission

source: Lubricate cables and housings
es: Lubricar cables y fundas
fr: Lubrifier les câbles et gaines

source: Grease bottom bracket
es: Engrasar el eje del pedalier
fr: Graisser le boîtier de pédalier

source: Replace cables and housings
es: Reemplazar cables y fundas
fr: Remplacer les câbles et gaines

source: Bleed hydraulic brakes
es: Sangrar frenos hidráulicos
fr: Purger les freins hydrauliques

source: Service bearings
es: Revisar rodamientos
fr: Réviser les roulements

source: Replace chain
es: Reemplazar la cadena
fr: Changer la chaîne

source: Run software and battery diagnostics
es: Diagnóstico de software y batería
fr: Diagnostiquer logiciel et batterie

# tires_description
source: Basic cleaning consists of: - Wiping the frame with a damp cloth - Checking the condition of the tires - Checking the pressure
es: La limpieza básica consiste en: - Limpiar el cuadro con un paño húmedo - Verificar el estado de los neumáticos - Comprobar la presión
fr: Le nettoyage de base consiste à : - Nettoyer le cadre avec un chiffon humide - Vérifier l'état des pneus - Contrôler la pression

# brake_pads_description
source: Brake adjustment requires tools
es: El ajuste de los frenos requiere herramientas
fr: Le réglage des freins nécessite des outils

# battery_description
source: Chain maintenance includes: - Cleaning with a degreaser - Lubricating the links - Checking for wear
es: El mantenimiento de la cadena incluye: - Limpieza con desengrasante - Lubricación de los eslabones - Comprobación del desgaste
fr: L'entretien de la chaîne comprend : - Nettoyage avec un dégraissant - Lubrification des maillons - Vérification de l'usure

# unknown_description
source: Unknown
es: Desconocido
fr: Inconnu

# check_tire_pressure_description
source: A properly inflated tire allows for a more comfortable ride, reduces the risk of punctures, and prevents premature wear. Check the pressure once a week, especially if you ride daily. Use a pressure gauge or a pump with an indicator, and inflate according to the range printed on the tire sidewall (e.g., 4–6 bars for a road bike, 2–3 bars for a mountain bike). Riding underinflated can pinch the tube in a pothole. Overinflated tires reduce comfort and grip.
es: Un neumático correctamente inflado permite un viaje más cómodo, reduce el riesgo de pinchazos y evita el desgaste prematuro. Comprueba la presión una vez por semana, especialmente si usas la bicicleta a diario. Usa un manómetro o una bomba con indicador y ajusta según el rango indicado en el flanco del neumático (ej.: 4–6 bares para bici de carretera, 2–3 bares para MTB). Con neumáticos poco inflados, corres el riesgo de pellizcar la cámara en un bache. Con neumáticos sobreinflados, disminuye la comodidad y se pierde adherencia.
fr: Un pneu bien gonflé permet de rouler plus confortablement, de réduire les risques de crevaison et d’éviter une usure prématurée. Vérifie la pression une fois par semaine, surtout si tu utilises ton vélo tous les jours. Utilise un manomètre ou une pompe avec indicateur, et gonfle selon la plage inscrite sur le flanc du pneu (exemple : 4 à 6 bars pour un vélo de route, 2 à 3 bars pour un VTT). Si tu roules sous-gonflé, tu risques de pincer la chambre à air dans un nid-de-poule. Si tu roules surgonflé, le confort diminue et tu perds en adhérence.

# replace_tires_description
source: Tires should never be completely smooth, and the sidewalls should show no cracks. If they do, they must be replaced immediately, as worn or damaged tires significantly increase the risk of puncture or even blowout. Smooth tires reduce traction, which can cause falls, especially on wet or unstable surfaces. Tires are the only contact point between the bike and the ground: their condition directly impacts safety. Never underestimate the importance of good tires for a safe ride.
es: Los neumáticos nunca deben estar completamente lisos, y los flancos no deben presentar grietas. Si lo están, deben reemplazarse inmediatamente, ya que un neumático desgastado o dañado aumenta significativamente el riesgo de pinchazo o explosión. Los neumáticos lisos reducen la tracción, lo que puede provocar caídas, especialmente en superficies mojadas o inestables. Los neumáticos son el único punto de contacto con el suelo: su estado impacta directamente en la seguridad. Nunca subestimes la importancia de buenos neumáticos para un viaje seguro.
fr: Les pneus ne doivent jamais être complètement lisses et les flancs ne doivent présenter aucune craquelure. Si c’est le cas, ils doivent être remplacés immédiatement, car un pneu usé ou abîmé augmente fortement le risque de crevaison, voire d’explosion. Des pneus lisses réduisent considérablement l’adhérence, ce qui peut provoquer des chutes, surtout sur sol mouillé ou instable. Les pneus constituent le seul point de contact entre le vélo et le sol : leur état a un impact direct sur la sécurité. Ne jamais sous-estimer l’importance de pneus en bon état pour rouler sereinement.

# clean_and_lubricate_chain_description
source: A clean and lubricated chain extends the life of the entire drivetrain. Clean it once a month with a cloth and a light degreaser. Avoid high-pressure jets that wash grease out of bearings. After cleaning, apply bike-specific oil (no engine oil or WD-40 alone) and wipe off excess: too much oil attracts dust. Proper lubrication ensures smooth pedaling and prevents premature wear of cogs and chainrings. Don’t wait until the chain looks dry or creaks to lubricate it!
es: Una cadena limpia y lubricada prolonga la vida útil de toda la transmisión. Límpiala una vez al mes con un paño y un desengrasante ligero. Evita el chorro de alta presión que elimina la grasa de los rodamientos. Después de limpiar, aplica aceite específico para bicicleta (no aceite de motor ni WD-40 solo) y quita el exceso: demasiado aceite atrae polvo. Una buena lubricación permite un pedaleo suave y previene el desgaste prematuro de piñones y platos. ¡No esperes a que la cadena parezca seca o haga ruidos para lubricarla!
fr: Une chaîne propre et lubrifiée prolonge la durée de vie de toute la transmission. Nettoie-la une fois par mois avec un chiffon et un dégraissant léger. Évite le jet haute pression qui chasse la graisse des roulements. Après nettoyage, applique une huile spéciale vélo (pas d’huile moteur ni de WD-40 seul) et essuie l’excédent : une chaîne trop huilée attire la poussière. Une bonne lubrification rend le pédalage fluide et évite l’usure prématurée des pignons et plateaux. N’attends pas que la chaine soit visuellement sèche ou craque à l’utilisation pour la lubrifier !

# tighten_main_screws_and_bolts_description
source: Vibrations can loosen some screws. Check the main screws once a month: stem, handlebars, saddle, pedals, and rack. Use the correct Allen keys, and if possible a torque wrench to respect the recommended torque (usually indicated on the part). Too loose = risk of play or fall; too tight = risk of stripping threads or cracking carbon parts.
es: Las vibraciones pueden aflojar algunos tornillos. Revisa una vez al mes los principales: potencia, manillar, sillín, pedales y portaequipajes. Usa llaves Allen adecuadas y, si es posible, una llave dinamométrica para respetar el par de apriete indicado (generalmente en la pieza). Demasiado flojo = riesgo de juego o caída; demasiado apretado = riesgo de dañar la rosca o romper piezas de carbono.
fr: Avec les vibrations, certaines vis peuvent se desserrer. Vérifie une fois par mois les vis principales : potence, cintre, selle, pédales et porte-bagage. Utilise des clés Allen adaptées, et si possible une clé dynamométrique pour respecter le couple de serrage (souvent indiqué sur la pièce). Un serrage trop faible = risque de jeu ou de chute, un serrage trop fort = risque de casser le filetage ou fissurer une pièce en carbone.

# clean_drivetrain_description
source: Over time, your bike's drivetrain gets dirty: grease, dust, and sometimes mud accumulate on the chainrings, cassette, and derailleur pulleys. Result: gears shift poorly, pedaling is less smooth, and parts wear faster. It’s recommended to clean the drivetrain roughly every three months, especially if you ride daily. You can do it yourself: remove the rear wheel to access the cassette better, brush the teeth with an old toothbrush or a special brush, then wipe with a cloth. The derailleur pulleys also need scraping as they collect dirt. Avoid high-pressure jets that remove bearing grease. Once cleaned, dry the parts and ensure the chain is lubricated. You will notice smoother shifting and longer drivetrain life.
es: Con el tiempo, la transmisión de la bicicleta se ensucia: grasa, polvo y a veces barro se acumulan en los platos, cassette y poleas del cambio. Resultado: los cambios funcionan peor, el pedaleo es menos suave y las piezas se desgastan más rápido. Se recomienda limpiar la transmisión cada tres meses, especialmente si se usa a diario. Puedes hacerlo tú mismo: quita la rueda trasera para acceder mejor al cassette, cepilla los dientes con un cepillo viejo o especial, y seca con un paño. Las poleas del cambio también necesitan limpieza. Evita el chorro de alta presión que elimina la grasa de los rodamientos. Una vez limpio, seca y lubrica la cadena. Notarás cambios: los cambios serán más suaves y la transmisión durará más.
fr: Avec le temps, la transmission de ton vélo s’encrasse : la graisse, la poussière et parfois la boue s’accumulent sur les plateaux, la cassette et les galets du dérailleur. Résultat : les vitesses passent moins bien, le pédalage devient moins fluide et l’usure des pièces s’accélère. C’est pourquoi il est conseillé de nettoyer la transmission environ tous les trois mois, surtout si tu utilises ton vélo tous les jours. Tu peux le faire toi-même facilement : retire la roue arrière pour mieux accéder à la cassette, brosse les dents avec une vieille brosse à dents ou une brosse spéciale, puis essuie avec un chiffon. Les galets du dérailleur méritent aussi un petit grattage car ils accumulent beaucoup de saleté. Évite absolument le jet haute pression qui chasse la graisse des roulements. Une fois le nettoyage terminé, sèche bien les pièces et assure-toi que la chaîne est lubrifiée. Tu verras tout de suite la différence : les vitesses passeront plus nettement et ta transmission durera beaucoup plus longtemps.

# lubricate_cables_and_housings_description
source: Brake and gear cables and housings oxidize over time, especially if exposed to moisture. Every six months, add a few drops of light oil in the housings (or use a suitable spray). This makes braking more responsive and shifting smoother. Always wipe off excess to avoid attracting dust and sand. If shifting or braking feels sticky despite lubrication, the cable is starting to wear and should be replaced.
es: Los cables y fundas de freno y cambio se oxidan con el tiempo, especialmente si se mojan. Cada seis meses, aplica unas gotas de aceite ligero en las fundas (o spray adecuado). Esto hace el frenado más reactivo y los cambios más suaves. Siempre quita el exceso para no atraer polvo o arena. Si notas fricción, el cable se está desgastando y debe reemplazarse.
fr: Les câbles et gaines de frein et de vitesse s’oxydent avec le temps, surtout s’ils prennent l’humidité. Tous les six mois, mets quelques gouttes d’huile fluide dans les gaines (ou un spray adapté). Cela rend le freinage plus réactif et les vitesses plus souples. Essuie toujours l’excédent pour éviter d’attirer poussière et sable. Si tu sens que ça accroche malgré la lubrification, cela veut dire que le câble commence à s’user et devra être changé.

# grease_bottom_bracket_description
source: The bottom bracket contains bearings that allow your cranks to rotate smoothly. Over time and mileage, grease dries or becomes contaminated, causing creaks, lateral play, or less smooth pedaling. Regular maintenance about every six months prevents these problems. This is not easy to do yourself, as it requires crank removal and specific tools. Usually, it’s better to leave this to a professional who will clean the bearings, apply appropriate grease, and reassemble at the correct torque. If you hear creaking with each pedal stroke or your cranks move side to side, the bottom bracket needs attention. Neglected bearings can seize, requiring complete replacement.
es: El eje del pedalier contiene rodamientos que permiten que las bielas giren sin resistencia. Con el tiempo y los kilómetros, la grasa se seca o contamina, causando crujidos, juego
fr: Le boîtier de pédalier contient les roulements qui permettent à tes manivelles de tourner sans résistance. Avec le temps et les kilomètres, la graisse sèche ou se contamine, ce qui peut provoquer des grincements, du jeu latéral ou un pédalage moins fluide. Un entretien régulier, environ tous les six mois, permet d’éviter ces problèmes. Mais attention : ce n’est pas une opération facile à faire soi-même car il faut démonter les manivelles et avoir des outils spécifiques. Dans la majorité des cas, il vaut mieux confier ce graissage à un réparateur. Il se chargera de démonter le boîtier, nettoyer les roulements et remettre une graisse adaptée avant de tout resserrer au bon couple. Si tu sens un craquement à chaque coup de pédale ou si tes manivelles bougent de gauche à droite, c’est un signe clair que le boîtier a besoin d’attention. Ne tarde pas, car des roulements négligés peuvent finir par se gripper et nécessiter un remplacement complet.
