Repository: elenabougaran/MyBikeMate
Catalog: CarCare/*.lproj/Localizable.strings
Languages: es, fr

# replace_cables_and_housings_description
source: Even when well-lubricated, cables fray, rust, and lose efficiency. Replace them once a year with a professional to ensure precise braking and shifting. Waiting too long may result in cable breakage during a ride, which is dangerous. New housings also reduce friction and make the bike feel more responsive.
fr: Même bien lubrifiés, les câbles s’effilochent, rouillent et perdent de leur efficacité. Une fois par an, fais-les remplacer par un réparateur. Cela garantit un freinage net et une transmission précise. Si tu attends trop, le câble peut casser en pleine sortie, ce qui est dangereux. Les gaines neuves réduisent aussi les frottements et donnent l’impression d’avoir un vélo plus “réactif”.

# bleed_hydraulic_brakes_description
source: For bikes with hydraulic brakes, the fluid should be changed about once a year. Over time, it accumulates air bubbles and loses effectiveness, resulting in spongy, imprecise braking. Bleeding should be done by a professional, as it requires tools and specific fluid (DOT or mineral depending on the brand). If the brake lever sinks too easily or braking becomes inconsistent, don’t wait.
fr: Si ton vélo a des freins hydrauliques, il faut changer le liquide environ une fois par an. Avec le temps, il se charge en bulles d’air et perd en efficacité. Résultat : un freinage mou et imprécis. La purge doit être faite par un pro, car elle nécessite des outils et du liquide spécifique (DOT ou minéral selon la marque). Si tu sens ton levier s’enfoncer trop facilement ou si ton freinage devient aléatoire, n’attends pas.

# service_bearings_description
source: Bearings are located in wheel hubs, the bottom bracket, and the headset. They ensure smooth operation. Once a year, have a full service: cleaning, greasing, and replacement if needed. Creaks or stiff pedaling indicate worn bearings. Well-maintained bearings prolong bike life and make pedaling more enjoyable.
fr: Les roulements se trouvent dans les moyeux de roues, le boîtier de pédalier et la direction. Ils assurent la fluidité du vélo. Une fois par an, demande une révision complète : nettoyage, graissage et remplacement si nécessaire. Si tu entends des craquements ou si le pédalage devient dur, c’est signe que les roulements souffrent. Des roulements bien entretenus prolongent la vie du vélo et rendent le pédalage plus agréable.

# replace_chain_description
source: Even when well-lubricated, a chain stretches with wear. Once a year (for daily use), it should be replaced. Otherwise, it prematurely wears the cassette and chainrings, which is more costly. Wear can be checked with a chain checker tool. A professional can measure and replace the chain. The chain and cassette are linked: replace both together.
fr: Même bien lubrifiée, une chaîne finit par s’allonger avec l’usure. Une fois par an (pour un usage quotidien), elle doit être remplacée. Sinon, elle use prématurément la cassette et les plateaux, ce qui coûte beaucoup plus cher. On peut vérifier l’usure avec un outil spécifique appelé “testeur de chaîne”. Un réparateur saura mesurer et changer rapidement la chaîne. Attention : la chaine et cassettes sont deux éléments intimement liés, il faut systématiquement remplacer les deux en même temps !

# run_software_and_battery_diagnostics_description
source: Modern e-bikes have electronic control (motor, battery, sensors). Once a year, have diagnostics done by an authorized repairer. This checks battery health (remaining capacity), updates firmware, and detects potential errors early. Monitor battery autonomy and check for overheating during use. After a crash or impact, replace the battery immediately, as internal cells can be damaged, posing fire risk or irreversible damage. Never use a damaged battery.
fr: Les vélos électriques modernes possèdent une électronique de contrôle (moteur, batterie, capteurs). Une fois par an, fais un diagnostic chez un réparateur agréé. Cela permet de vérifier l’état de la batterie (capacité restante), de mettre à jour le firmware et de détecter d’éventuelles erreurs avant qu’elles ne posent problème. Il faut surveiller régulièrement l’autonomie de la batterie et vérifier qu’elle ne chauffe pas pendant l’utilisation du vélo. En cas de chute ou de choc, la batterie doit être remplacée immédiatement. En effet, un impact peut déséquilibrer les cellules internes, ce qui présente un risque sérieux d’inflammation ou d’endommagement irréversible. Ne tente jamais de continuer à utiliser une batterie endommagée.

source: Manual
fr: Musculaire

source: Electric
es: Eléctrico
fr: Électrique

# error_title
source: Error
fr: Erreur

source: Unknown error
es: Error desconocido
fr: Erreur inconnue

# bike_error
source: Bike-related error
es: Error relacionado con la bicicleta
fr: Erreur liée au vélo

# maintenance_error
source: Maintenance-related error
es: Error relacionado con los mantenimientos
fr: Erreur liée aux entretiens

# bike_load_failed
source: An error occurred while loading the bike.
es: Ocurrió un error al cargar la bicicleta.
fr: Une erreur est survenue lors du chargement du vélo.

# data_unavailable
source: Your data is not available.
es: Sus datos no están disponibles.
fr: Vos données ne sont pas disponibles.

# loading_data_failed
source: Error loading data: %@.
es: Error al cargar los datos: %@.
fr: Erreur lors du chargement des données : %@.

# fetch_data_failed
source: Error fetching data: %@.
es: Error al cargar los datos: %@.
fr: Erreur lors du chargement des données : %@.

# save_data_failed
source: Error saving data: %@.
es: Error al guardar los datos: %@.
fr: Erreur lors de la sauvegarde des données : %@.

# notification_not_authorized
source: Notifications are not authorized.
es: Las notificaciones no están autorizadas.
fr: Les notifications ne sont pas autorisées.

# bike_not_found
source: No bike found
es: La bicicleta no se encontró.
fr: Le vélo n'a pas été trouvé.

# unknown_error_message
source: An unexpected error occurred.
fr: Une erreur inattendue est survenue.

# notification_failed
source: Notification scheduling failed
es: Error al programar la notificación
fr: Échec de la planification de la notification

# pdf_writing_failed
source: Failed to generate the PDF file
es: Error al generar el archivo PDF
fr: Échec de la génération du fichier PDF

# maintenance_soon_due
source: Soon to be planned
es: Próximamente a planificar
fr: Bientôt à prévoir

source: Unknown
es: Desconocido
fr: Inconnu

# maintenance_message_up_to_date
source: You're up to date
es: Estás al día
fr: Tu es à jour

# maintenance_message_not_yet
source: No need to worry yet
es: Aún no tienes que preocuparte
fr: Tu n'as pas encore à t'en préoccuper

# maintenance_message_due
source: It's time! Schedule an appointment with the nearest mechanic or do it by yourself
es: ¡Es hora! Agenda una cita con el mecánico más cercano o hazlo tú mismo
fr: C'est l'heure! Pense à prendre rendez-vous chez le réparateur le plus proche ou fais le toi-même

# paywall_title
source: Go Premium 🚴‍♂️
es: Hazte Premium 🚴‍♂️
fr: Passez Premium 🚴‍♂️

# paywall_description
source: Unlock all features and add as many maintenances as you want!
es: Desbloquea todas las funciones y añade tantos mantenimientos como quieras!
fr: Débloquez toutes les fonctionnalités et ajoutez autant de maintenances que vous voulez !

# paywall_weekly
source: Weekly
es: Semanal
fr: Hebdomadaire

# paywall_yearly
source: Yearly
es: Anual
fr: Annuel

# paywall_price_weekly
source: 0.95$ / week
es: 0.95€ / semana
fr: 0.95€ / semaine

# paywall_price_yearly
source: 25$ / year
es: 30€ / año
fr: 30€ / an

# paywall_button_upgrade
source: Go Premium
es: Hazte Premium
fr: Devenir Premium

# paywall_button_restore
source: Restore Purchases
es: Restaurar compras
fr: Restaurer les achats

# paywall_button_cancel
source: Cancel
es: Cancelar
fr: Annuler

# type_key
source: Type
es: Tipo

# identification_number_key
source: Identification :
es: Identificación:

# type_label
source: Type
es: Tipo

# date_label
source: Date
es: Fecha

# notifications_key
source: Notifications
es: Notificaciones

source: Tires
es: Neumáticos

source: Brakepads
es: Pastillas de freno

source: Battery
es: Batería
